In [1]:
#### Adam Chow DS 2002 Midterm Project

In [2]:
import os
import json
import numpy
import datetime
import pandas as pd

import pymongo
from sqlalchemy import create_engine

In [3]:
# Declare & Assign Connection Variables for the MongoDB Server, the MySQL Server & Databases
host_name = "localhost"
host_ip = "127.0.0.1"
port = "3306"
user_id = "root"
pwd = "Passw0rd123"

#----------------------------------------------

# Declare & Assign Connection Variables for the MongoDB Server, the MySQL Server & Databases
src_dbname = "sakila"
dst_dbname = "sakila_dw"
mysql_uid = "root"
mysql_pwd = "Passw0rd123"
mysql_host = "ds2002-mysql.mysql.database.azure.com"

atlas_cluster_name = "cluster0.z5pf4tg"
atlas_user_name = "ryp6vw"
atlas_password = "Premier#13!!!"

conn_mongo_str = {"local" : f"mongodb://localhost:27017/",
    "atlas" : f"mongodb+srv://{atlas_user_name}:{atlas_password}@{atlas_cluster_name}.mongodb.net"
}

src_dbname = "sakila"
dst_dbname = "sakila_dw"

print(f"Local Connection String: {conn_mongo_str['local']}")
print(f"Atlas Connection String: {conn_mongo_str['atlas']}")

Local Connection String: mongodb://localhost:27017/
Atlas Connection String: mongodb+srv://ryp6vw:Premier#13!!!@cluster0.z5pf4tg.mongodb.net

#### Define Functions for Getting Data From and Setting Data Into Databases

In [4]:
def get_dataframe(user_id, pwd, host_name, db_name, sql_query):
    conn_sql_str = f"mysql+pymysql://{user_id}:{pwd}@{host_name}/{db_name}"
    sqlEngine = create_engine(conn_sql_str, pool_recycle=3600)
    connection = sqlEngine.connect()
    dframe = pd.read_sql(sql_query, connection);
    connection.close()
    
    return dframe


def set_dataframe(user_id, pwd, host_name, db_name, df, table_name, pk_column, db_operation):
    conn_sql_str = f"mysql+pymysql://{user_id}:{pwd}@{host_name}/{db_name}"
    sqlEngine = create_engine(conn_sql_str, pool_recycle=3600)
    connection = sqlEngine.connect()
    
    if db_operation == "insert":
        df.to_sql(table_name, con=connection, index=False, if_exists='replace')
        sqlEngine.execute(f"ALTER TABLE {table_name} ADD PRIMARY KEY ({pk_column});")
            
    elif db_operation == "update":
        df.to_sql(table_name, con=connection, index=False, if_exists='append')
    
    connection.close()
    
#--------------------------------------------------------------
    
def get_sql_dataframe(user_id, pwd, db_name, sql_query):
    '''Create a connection to the MySQL database'''
    conn_mongo_str = f"mysql+pymysql://{user_id}:{pwd}@localhost/{db_name}"
    sqlEngine = create_engine(conn_mongo_str, pool_recycle=3600)
    
    '''Invoke the pd.read_sql() function to query the database, and fill a Pandas DataFrame.'''
    conn = sqlEngine.connect()
    dframe = pd.read_sql(sql_query, conn);
    conn.close()
    
    return dframe


def get_mongo_dataframe(connect_str, db_name, collection, query):
    '''Create a connection to MongoDB'''
    client = pymongo.MongoClient(connect_str)
    
    '''Query MongoDB, and fill a python list with documents to create a DataFrame'''
    db = client[db_name]
    dframe = pd.DataFrame(list(db[collection].find(query)))
    dframe.drop(['_id'], axis=1, inplace=True)
    client.close()
    return dframe


def set_dataframe(user_id, pwd, db_name, df, table_name, pk_column, db_operation):
    '''Create a connection to the MySQL database'''
    conn_mongo_str = f"mysql+pymysql://{user_id}:{pwd}@localhost/{db_name}"
    sqlEngine = create_engine(conn_mongo_str, pool_recycle=3600)
    connection = sqlEngine.connect()
    
    '''Invoke the Pandas DataFrame .to_sql( ) function to either create, or append to, a table'''
    if db_operation == "insert":
        df.to_sql(table_name, con=connection, index=False, if_exists='replace')
        sqlEngine.execute(f"ALTER TABLE {table_name} ADD PRIMARY KEY ({pk_column});")
            
    elif db_operation == "update":
        df.to_sql(table_name, con=connection, index=False, if_exists='append')
    
    connection.close()

In [5]:
### Create the New Data Warehouse database, and to Use it, Switch the Connection Context.
conn_sql_str = f"mysql+pymysql://{user_id}:{pwd}@{host_name}"
sqlEngine = create_engine(conn_sql_str, pool_recycle=3600)

sqlEngine.execute(f"DROP DATABASE IF EXISTS `{dst_dbname}`;")
sqlEngine.execute(f"CREATE DATABASE `{dst_dbname}`;")
sqlEngine.execute(f"USE {dst_dbname};")

#### Populate MongoDB with Source Data
You only need to run this cell once; however, the operation is *idempotent*.  In other words, it can be run multiple times without changing the end result.

In [6]:
client = pymongo.MongoClient(conn_mongo_str["atlas"])
db = client[src_dbname]

# Gets the path of the Current Working Directory for this Notebook, and then Appends the 'data' directory.
data_dir = os.path.join(os.getcwd(), 'data')

json_files = {"rental" : 'sakila_rental.json',
              "customer" : 'sakila_customer.json',
              "payment" : 'sakila_payment.json'
             }

for file in json_files:
    db.drop_collection(file)
    json_file = os.path.join(data_dir, json_files[file])
    with open(json_file, 'r') as openfile:
        json_object = json.load(openfile)
        file = db[file]
        result = file.insert_many(json_object)
        #print(f"{file} was successfully loaded.")

        
client.close()

### 1.0. Create and Populate the New Dimension Tables
#### 1.1. Extract Data from the Source MongoDB Collections Into DataFrames

In [7]:
### Using file System (.csv)
df_rental = pd.read_csv("sakila_rental.csv")
df_rental.head(2)

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53

In [8]:
### Extract Data from the Source Database Tables
sql_customer = "SELECT * FROM sakila.customer;"
df_customer = get_dataframe(user_id, pwd, host_name, src_dbname, sql_customer)
df_customer.head(2)

,customer_id,store_id,first_name,last_name,email,address_id,active,create_date,last_update
0,1,1,MARY,SMITH,MARY.SMITH@sakilacustomer.org,5,1,2006-02-14 22:04:36,2006-02-15 04:57:20
1,2,1,PATRICIA,JOHNSON,PATRICIA.JOHNSON@sakilacustomer.org,6,1,2006-02-14 22:04:36,2006-02-15 04:57:20

In [9]:
### Extract Data from the Source Database Tables
sql_date = "SELECT date_key, full_date FROM sakila.dim_date;"
df_date = get_dataframe(user_id, pwd, host_name, src_dbname, sql_date)
df_date.full_date = df_date.full_date.astype('datetime64')
df_date.head(2)

   date_key  full_date
0  20000101 2000-01-01
1  20000102 2000-01-02

In [10]:
### Extract Data from the Source MongoDB Collections Into DataFrames
query2 = {}
collection2 = "payment"

df_payment = get_mongo_dataframe(conn_mongo_str['atlas'], src_dbname, collection2, query2)
df_payment.head(2)

,payment_id,customer_id,staff_id,rental_id,amount,payment_date,last_update
0,1,1,1,76,2.99,2005-05-25 11:30:37,2006-02-15 22:12:30
1,2,1,1,573,0.99,2005-05-28 10:35:23,2006-02-15 22:12:30

#### 1.2. Perform Any Necessary Transformations to the DataFrames

In [11]:
drop_cols = ['staff_id','last_update']
df_rental.drop(drop_cols, axis=1, inplace=True)
df_rental.rename(columns={"rental_id":"rental_key", "customer_id":"customer_key"}, inplace=True)

df_rental.head(2)

,rental_key,rental_date,inventory_id,customer_key,return_date
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33

In [12]:
drop_cols = ['active','last_update','create_date']
df_customer.drop(drop_cols, axis=1, inplace=True)
df_customer.rename(columns={"customer_id":"customer_key"}, inplace=True)

df_customer.head(2)

,customer_key,store_id,first_name,last_name,email,address_id
0,1,1,MARY,SMITH,MARY.SMITH@sakilacustomer.org,5
1,2,1,PATRICIA,JOHNSON,PATRICIA.JOHNSON@sakilacustomer.org,6

In [13]:
drop_cols = ['last_update', 'payment_date']
df_payment.drop(drop_cols, axis=1, inplace=True)
df_payment.rename(columns={"payment_id":"payment_key","customer_id":"customer_key"}, inplace=True)

df_payment.head(2)

   payment_key  customer_key  staff_id  rental_id  amount
0            1             1         1         76    2.99
1            2             1         1        573    0.99

#### 1.3. Load the Transformed DataFrames into the New Data Warehouse by Creating New Tables

Here we will call our **set_dataframe( )** function to create each dimension table. This function expects a number of parameters including the usual connection information (e.g., user_id, password, MySQL server name and database), the *table_name* we need to assign to the table, the *pandas DataFrame* we crafted to define & populate the table, the *name* we need to assign to the *primary_key* column, and finally, the database operation (insert or update).

In [14]:
dataframe = df_rental
table_name = 'dim_rental'
primary_key = 'rental_key'
db_operation = "insert"

set_dataframe(mysql_uid, mysql_pwd, dst_dbname, dataframe, table_name, primary_key, db_operation)

In [15]:
dataframe = df_customer
table_name = 'dim_customer'
primary_key = 'customer_key'
db_operation = "insert"

set_dataframe(mysql_uid, mysql_pwd, dst_dbname, dataframe, table_name, primary_key, db_operation)

In [16]:
dataframe = df_date
table_name = 'dim_date'
primary_key = 'date_key'
db_operation = "insert"

set_dataframe(mysql_uid, mysql_pwd, dst_dbname, dataframe, table_name, primary_key, db_operation)

In [17]:
dataframe = df_payment
table_name = 'dim_payment'
primary_key = 'payment_key'
db_operation = "insert"

set_dataframe(mysql_uid, mysql_pwd, dst_dbname, dataframe, table_name, primary_key, db_operation)

#### 1.4. Validate that the New Dimension Tables were Created.

In [18]:
sql_rental = "SELECT * FROM sakila_dw.dim_rental;"
df_dim_rental = get_sql_dataframe(mysql_uid, mysql_pwd, dst_dbname, sql_rental)
df_dim_rental.head(2)

,rental_key,rental_date,inventory_id,customer_key,return_date
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33

In [19]:
sql_customer = "SELECT * FROM sakila_dw.dim_customer;"
df_dim_customer = get_sql_dataframe(mysql_uid, mysql_pwd, dst_dbname, sql_customer)
df_dim_customer.head(2)

,customer_key,store_id,first_name,last_name,email,address_id
0,1,1,MARY,SMITH,MARY.SMITH@sakilacustomer.org,5
1,2,1,PATRICIA,JOHNSON,PATRICIA.JOHNSON@sakilacustomer.org,6

In [20]:
sql_date = "SELECT * FROM sakila_dw.dim_date;"
df_dim_date = get_sql_dataframe(mysql_uid, mysql_pwd, dst_dbname, sql_date)
df_dim_date.head(2)

   date_key  full_date
0  20000101 2000-01-01
1  20000102 2000-01-02

In [21]:
sql_payment = "SELECT * FROM sakila_dw.dim_payment;"
df_dim_payment = get_sql_dataframe(mysql_uid, mysql_pwd, dst_dbname, sql_payment)
df_dim_payment.head(2)

   payment_key  customer_key  staff_id  rental_id  amount
0            1             1         1         76    2.99
1            2             1         1        573    0.99

### 2.1. Create and Populate the New Fact Tables
#### 2.2. Extract Data from the Source MongoDB Collections Into DataFrames

In [22]:
### Merge df_rental and df_customer together on 'customer_key'
df_fact_rental_orders = pd.merge(df_rental, df_customer, on='customer_key', how='inner')
df_fact_rental_orders.insert(0, "step", range(1, df_fact_rental_orders.shape[0]+1))

df_fact_rental_orders.head(2)

,step,rental_key,rental_date,inventory_id,customer_key,return_date,store_id,first_name,last_name,email,address_id
0,1,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,CHARLOTTE,HUNTER,CHARLOTTE.HUNTER@sakilacustomer.org,134
1,2,746,2005-05-29 09:25:10,4272,130,2005-06-02 04:20:10,1,CHARLOTTE,HUNTER,CHARLOTTE.HUNTER@sakilacustomer.org,134

In [23]:
### Merge the df_rental and df_customer with df_payment together on 'customer_key'

df_fact_rental_orders = pd.merge(df_fact_rental_orders, df_payment, on='customer_key', how='inner')
df_fact_rental_orders.insert(0, "step2", range(1, df_fact_rental_orders.shape[0]+1))

df_fact_rental_orders['rental_date'] = pd.to_datetime(df_fact_rental_orders['rental_date']).dt.date
df_fact_rental_orders['return_date'] = pd.to_datetime(df_fact_rental_orders['return_date']).dt.date
df_fact_rental_orders.return_date = df_fact_rental_orders.return_date.astype('datetime64')

df_fact_rental_orders.head(2)

,step2,step,rental_key,rental_date,inventory_id,customer_key,return_date,store_id,first_name,last_name,email,address_id,payment_key,staff_id,rental_id,amount
0,1,51,18,2005-05-25,3376,19,2005-05-31,1,RUTH,MARTINEZ,RUTH.MARTINEZ@sakilacustomer.org,23,490,2,18,0.99
1,2,51,18,2005-05-25,3376,19,2005-05-31,1,RUTH,MARTINEZ,RUTH.MARTINEZ@sakilacustomer.org,23,491,2,110,9.99

In [24]:
### Merge the combined df_fact_rental_orders table with the df_dim_order_date table together on 'rturn_date'
### Then Drop unnecessary date-related columns

df_dim_order_date = df_dim_date.rename(columns={"date_key" : "rental_date_key", "full_date" : "return_date"})
df_fact_rental_orders = pd.merge(df_fact_rental_orders, df_dim_order_date, on='return_date', how='left')
df_fact_rental_orders.drop(['rental_date', 'return_date'], axis=1, inplace=True)
df_fact_rental_orders.head(2)

,step2,step,rental_key,inventory_id,customer_key,store_id,first_name,last_name,email,address_id,payment_key,staff_id,rental_id,amount,rental_date_key
0,1,51,18,3376,19,1,RUTH,MARTINEZ,RUTH.MARTINEZ@sakilacustomer.org,23,490,2,18,0.99,20050531
1,2,51,18,3376,19,1,RUTH,MARTINEZ,RUTH.MARTINEZ@sakilacustomer.org,23,491,2,110,9.99,20050531

In [25]:
# Drop remaining unnecessary columns that do not provide meaningful value
drop_columns = ['step2', 'step', 'inventory_id', 'store_id', 'address_id', 'staff_id', 'rental_id']
df_fact_rental_orders.drop(drop_columns, axis=1, inplace=True)

# Rename Foreign Key Columns
df_fact_rental_orders.rename(columns={"first_name" : "customer_first_name",
                               "last_name" : "customer_last_name",
                               "email" : "customer_email",
                               "amount" : "paid_amount"}, inplace=True)


# Reorder the columns
ordered_columns = ["customer_key",
                  "payment_key",
                  "rental_key",
                  "rental_date_key",
                  "customer_first_name",
                  "customer_last_name",
                  "customer_email",
                  "paid_amount"
                  ]
df_fact_rental_orders = df_fact_rental_orders[ordered_columns]
df_fact_rental_orders.insert(0, "fact_rental_order_key", range(1, df_fact_rental_orders.shape[0]+1))
df_fact_rental_orders.head(5)

,fact_rental_order_key,customer_key,payment_key,rental_key,rental_date_key,customer_first_name,customer_last_name,customer_email,paid_amount
0,1,19,490,18,20050531,RUTH,MARTINEZ,RUTH.MARTINEZ@sakilacustomer.org,0.99
1,2,19,491,18,20050531,RUTH,MARTINEZ,RUTH.MARTINEZ@sakilacustomer.org,9.99
2,3,19,492,18,20050531,RUTH,MARTINEZ,RUTH.MARTINEZ@sakilacustomer.org,6.99
3,4,19,493,18,20050531,RUTH,MARTINEZ,RUTH.MARTINEZ@sakilacustomer.org,2.99
4,5,19,494,18,20050531,RUTH,MARTINEZ,RUTH.MARTINEZ@sakilacustomer.org,2.99

In [26]:
# Load the new Transformed DataFrame into the New Data Warehouse by Creating a New Table
dataframe = df_fact_rental_orders
table_name = "fact_rental_orders"
primary_key = "fact_rental_order_key"
db_operation = "insert"

set_dataframe(mysql_uid, mysql_pwd, dst_dbname, dataframe, table_name, primary_key, db_operation)

#### 2.3. Count the number of payments made by each customer email and the total amount of money paid for each email (test)

In [27]:
df_rental_order_by_email = df_fact_rental_orders.groupby('customer_email')['paid_amount'].agg(['count', 'sum'])
df_rental_order_by_email.head(5)

                                     count     sum
customer_email
AMY.LOPEZ@sakilacustomer.org            58  255.42
ANGELA.HERNANDEZ@sakilacustomer.org     36  140.64
ANNA.HILL@sakilacustomer.org            21   91.79
BETTY.WHITE@sakilacustomer.org         140  588.60
CAROL.GARCIA@sakilacustomer.org         66  275.34

In [28]:
renamed_df_rental_order_by_email = df_rental_order_by_email.rename(columns={'count': 'number_of_payments', 'sum': 'total_amount_paid'})
renamed_df_rental_order_by_email.head(5)

                                     number_of_payments  total_amount_paid
customer_email
AMY.LOPEZ@sakilacustomer.org                         58             255.42
ANGELA.HERNANDEZ@sakilacustomer.org                  36             140.64
ANNA.HILL@sakilacustomer.org                         21              91.79
BETTY.WHITE@sakilacustomer.org                      140             588.60
CAROL.GARCIA@sakilacustomer.org                      66             275.34